---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.GetLocalPlacement
source: html/faf76fac-5c98-193d-5fe0-aa7724898564.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.GetLocalPlacement Method

Gets the reference to the IfcLocalPlacement handle used when creating the extrusion.

## Syntax (C#)
```csharp
public IFCAnyHandle GetLocalPlacement()
```

## Returns
The IfcLocalPlacement handle.